In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('train.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df_copy = df.copy()
df_copy['Family'] = df_copy['SibSp'] + df_copy['Parch'] + 1
df_copy.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,1
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,5
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,3
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,2
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,3
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,1
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,7
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,1
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,1
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,6
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,1
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,2
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,1

In [61]:
df_copy['Family'].value_counts()

1     537
2     161
3     102
4      29
6      22
5      15
7      12
11      7
8       6
Name: Family, dtype: int64

家族がいる人の数がわかった。891-537=354

次に、家族のユニーク数を推定する

In [9]:
df_copy[df_copy['Name'].str.find('Futrelle') != -1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S,2
137,138,0,1,"Futrelle, Mr. Jacques Heath",male,37.0,1,0,113803,53.1,C123,S,2

名字, 敬称. 名前(既婚の場合夫の名前) ミドルネーム (結婚前の名前、名字)の並びになっている

In [91]:
df_copy['Name'].str.extract('([^,]+)')[0].str.strip()

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: 0, Length: 891, dtype: object

In [96]:
df_copy['LastName'] = df_copy['Name'].str.extract('([^,]+)')[0].str.strip()

In [97]:
df_copy['LastName'].value_counts()

Andersson    9
Sage         7
Panula       6
Skoog        6
Johnson      6
            ..
Cumings      1
Rood         1
Mernagh      1
Celotti      1
Bengtsson    1
Name: LastName, Length: 667, dtype: int64

ミドルネームを含めてみる

In [55]:
df_copy['Name'].str.extract('.*?\. ([^\(]+)')[0].str.strip()

0                   Owen Harris
1                  John Bradley
2                         Laina
3                 Jacques Heath
4                 William Henry
                 ...
886                      Juozas
887              Margaret Edith
888    Catherine Helen "Carrie"
889                 Karl Howell
890                     Patrick
Name: 0, Length: 891, dtype: object

In [56]:
df_copy['FirstMiddleName'] = df_copy['Name'].str.extract('.*?\. ([^\(]+)')[0].str.strip()

In [57]:
df_copy['FirstMiddleName'].value_counts()

William             11
John                10
James                9
Mary                 6
Thomas               5
                    ..
Ellen Natalia        1
Elisabeth Walton     1
Johan Emil           1
Sam                  1
Thomas Leonard       1
Name: FirstMiddleName, Length: 713, dtype: int64

In [66]:
type(df_copy['FirstMiddleName'].value_counts())

pandas.core.series.Series

In [105]:
GroupByName = df_copy['LastName'].value_counts()

In [106]:
GroupByName[GroupByName != 1].count()

133

In [72]:
df_copy['FirstMiddleName'].loc[50:60]

50             Juha Niilo
51          Richard Cater
52          Henry Sleeper
53                 Lizzie
54    Engelhart Cornelius
55                   Hugh
56                  Emily
57               Mansouer
58       Constance Mirium
59      William Frederick
60                  Orsen
Name: FirstMiddleName, dtype: object

In [80]:
df_copy['FirstMiddleName'].isnull().sum()

16

名字が取得できない列は削除する

In [76]:
df_copy[df_copy['FirstMiddleName'].isnull() == True].index

Int64Index([15, 66, 166, 190, 259, 272, 327, 362, 367, 483, 516, 556, 564, 772,
            823, 865],
           dtype='int64')

In [77]:
df_copy_d = df_copy.drop(df_copy[df_copy['FirstMiddleName'].isnull() == True].index)

In [100]:
df_copy.drop('FirstName', axis=1, inplace=True)

In [101]:
Family_dict = dict(df_copy['LastName'].value_counts())
df_copy['FamilyNum'] = df_copy['LastName'].apply(lambda x: Family_dict[x])
df_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family,FirstMiddleName,LastName,FamilyNum
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2,Owen Harris,Braund,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,John Bradley,Cumings,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Laina,Heikkinen,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,Jacques Heath,Futrelle,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,William Henry,Allen,2

In [102]:
family_list = df_copy['LastName'][df_copy['FamilyNum'] >= 2]
family_list

0          Braund
3        Futrelle
4           Allen
5           Moran
7         Palsson
          ...
876    Gustafsson
877       Petroff
885          Rice
887        Graham
888      Johnston
Name: LastName, Length: 357, dtype: object

In [103]:
len(family_list.unique())

133

推定結果：<br>
乗船者の中に家族がいる人の数　354人<br>
家族のグループ数　133世帯

In [104]:
df_copy.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Family,FamilyNum
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658,-0.040143,-0.019629
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,0.016639,-0.049188
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.065997,0.113262
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,-0.301914,-0.227600
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,0.890712,0.667568
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,0.783111,0.600538
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,0.217138,0.105880
Family,-0.040143,0.016639,0.065997,-0.301914,0.890712,0.783111,0.217138,1.000000,0.756279
FamilyNum,-0.019629,-0.049188,0.113262,-0.227600,0.667568,0.600538,0.105880,0.756279,1.000000

In [89]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PassengerId      891 non-null    int64
 1   Survived         891 non-null    int64
 2   Pclass           891 non-null    int64
 3   Name             891 non-null    object
 4   Sex              891 non-null    object
 5   Age              714 non-null    float64
 6   SibSp            891 non-null    int64
 7   Parch            891 non-null    int64
 8   Ticket           891 non-null    object
 9   Fare             891 non-null    float64
 10  Cabin            204 non-null    object
 11  Embarked         889 non-null    object
 12  Family           891 non-null    int64
 13  FirstName        875 non-null    object
 14  FirstMiddleName  875 non-null    object
dtypes: float64(2), int64(6), object(7)
memory usage: 104.5+ KB

In [90]:
df_copy['Name'][df_copy['FirstName'].isnull()]

15                      Hewlett, Mrs. (Mary D Kingcome)
66                          Nye, Mrs. (Elizabeth Ramell)
166               Chibnall, Mrs. (Edith Martha Bowerman)
190                                  Pinsky, Mrs. (Rosa)
259                          Parrish, Mrs. (Lutie Davis)
272            Mellinger, Mrs. (Elizabeth Anne Maidment)
327                              Ball, Mrs. (Ada E Hall)
362                      Barbara, Mrs. (Catherine David)
367                       Moussa, Mrs. (Mantoura Boulos)
483                               Turkula, Mrs. (Hedwig)
516                         Lemore, Mrs. (Amelia Milley)
556    Duff Gordon, Lady. (Lucille Christiana Sutherl...
564                       Meanwell, Miss. (Marion Ogden)
772                                    Mack, Mrs. (Mary)
823                                   Moor, Mrs. (Beila)
865                             Bystrom, Mrs. (Karolina)
Name: Name, dtype: object